Revit 2024 API
ExporterIFCUtils.CreateGUID Method
 Creates a randomized GUID.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static string CreateGUID()
Visual Basic
Public Shared Function CreateGUID As String
Visual C++
public:
static String^ CreateGUID()
Return Value
 The guid string.
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace